---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireType.MaxSize
source: html/9daae522-61ec-5e23-be5c-7a6809370e51.htm
---
# Autodesk.Revit.DB.Electrical.WireType.MaxSize Property

The max size of the wire type.

## Syntax (C#)
```csharp
public WireSize MaxSize { get; set; }
```